import disnake                       # импорт Discord-API (disnake)
from disnake.ext import commands  # обращается к disnake для использования метода commands 

intents = disnake.Intents.default()   # создает переменную и стандартные значения для получения событий Discord 
intents.members=True
intents.message_content=True           # Разрешает боту получать информацию об участниках и содержимое сообщений.


bot = commands.Bot(               # инициализация объекта бота. (создает экземпляр бота)
    command_prefix="!",         #  Cимвол, с которого должны начинаться команды для этого бота (например, !help).
    intents=intents               # передача прав доступа и разрешений (намерений) для отслеживания событий (например, сообщений или участников)
)

# декоратор bot.event, который обращается к функции on_ready, и выдает сообщение о запуске бота 
@bot.event
async def on_ready():
    print(f'Бот запущен {bot.user}')       # выводит текст в терминал о том, что запуск бота успешно произведен 


@bot.slash_command(name='ping', description='узнать вашу задержку')  # декоратор bot.slash_command, превращает код в slash команду дискорда 
async def ping(inter):         # async def — это специальный вид функции Python, который используется для асинхронного выполнения, она нужна для того что бы функция не зависала на месте, а ping это название функции.
    latency = round(bot.latency * 1000)  # bot.latency * 1000 это метод disnake, который позволяет получить задержку пользователя.
    if latency < 100:  # обращаемся к переменной latency к которой присвоен метод определения задержки ползователя, и проверяет условие  
      status = "🟢Отличное соединение!"
    elif latency < 200:       # проверяет второе условие, оно срабатывает при задержке пользователя 100-199 
       status = "🟡Нормальное соединение!"
    else:                         # работает при задержке <200
       status = "🔴Высокая задержка!" 
    await inter.response.send_message(f'Pong🏓\nВаша задержка: {latency}ms\n{status}')  # await говорит: «Подожди завершения этой асинхронной операции».
# inter — это объект взаимодействия с Discord.
# Discord передаёт нашей функции информацию об этом взаимодействии.
# Например, через inter мы можем получить информацию о пользователе, сервере и самой команде.
# send_message = Говорим Discord:
# «Отправь сообщение».






bot.run('MTU1NjY0NTY2MTg5MjU0MjQ4NA.GeaTCo.Cv0cs-P4Q71DRtR8KIRmDUthEure47RudaEIXA')   # отвечает за запуск бота 
